# FamilyItemFactory Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyItemFactory Class
Members See Also
---
The Family Item Factory object is used to create new instances of elements within the Autodesk Revit Family.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FamilyItemFactory : ItemFactoryBase
```

Visual Basic
---
```text
Public Class FamilyItemFactory _
	Inherits ItemFactoryBase
```

Visual C++
---
```text
public ref class FamilyItemFactory : public ItemFactoryBase
```

# Remarks
The Family Item Factory object is a utility object that is used to create new instances of elements within the Autodesk Revit Family Document. This object should be used to create elements instead of using New. This object ensures that the elements created are added to the family document correctly.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.Creation..::..ItemFactoryBase Autodesk.Revit.Creation..::..FamilyItemFactory
# See Also
FamilyItemFactory Members
Autodesk.Revit.Creation Namespace